#+title: Using Chez Scheme

* The Interactive Environment
- interaction environment(top-level), which is a mutable environment that initially holds bindings only for built-in keywords and primitives.
- the default interaction environment used for any code out side of an RNRS top-level program or library contains all of the bindings of the (chezscheme) library (or scheme module)
  #+begin_src scheme
  (= 3)
  #+end_src

  #+RESULTS:
  : #t

- to replace these with bindings strictly compatible with RNRS
  #+begin_src scheme
  (import (rnrs)
          (rnrs eval)
          (rnrs mutable-pairs)
          (rnrs r5rs))
  #+end_src
- to obtain an interaction environment that contains all and only RNRS bindings, use the following
  #+begin_src scheme
  (interaction-environment
   (copy-environment
    (environment
     '(rnrs)
     '(rnrs eval)
     '(rnrs mutable-pairs)
     '(rnrs mutable-strings)
     '(rnrs r5rs))
    #t))
  #+end_src
- to be useful for most purposes, library and import should also be included from (chezscheme) library
  with strictly RNRS bindings, the following will throw exception
  #+begin_src scheme
   (= 3)
  #+end_src

  # RESULTS
  #+begin_src
  Exception: incorrect argument count in call (= 3)
  Type (debug) to enter the debugger.
  #+end_src
- variables that name built-in procedures are read-only and cannot be assigned
  #+begin_src scheme
  (set! cons +)
  ;; Exception: attempt to assign immutable variable cons
  #+end_src
- turn built-in variable into a mutable one
  #+begin_src scheme
  (define cons (let () (import scheme) cons))
  #+end_src
